[
    {
        "id": 1,
        "image": "https://i.postimg.cc/50Why3s9/google-1-1-1.png",
        "designation": "Technical Database Engineer",
        "name": "Google LLC",
        "type": "Onsite",
        "location": "New York, NY",
        "salary": "$100,000 - $150,000",
        "duration": "Full Time",
        "job_description": "As a Technical Database Engineer at Google, you will be responsible for designing, implementing and maintaining complex databases used by the company. You will work closely with software engineers, data scientists and other stakeholders to ensure data quality, reliability and performance.",
        "job_responsibilities": "Design and maintain complex databases, including database schema design, indexing, partitioning and performance tuning.Work closely with software engineers to ensure database-related code is efficient and optimized.Develop and maintain data pipelines and ETL workflows.Develop and maintain automated database monitoring and alerting systems.Participate in on-call rotation for database-related incidents.",
        "educational_requirements": "Bachelor's degree in Computer Science or related field, or equivalent practical experience.",
        "experience": "Minimum 5 years of experience as a database engineer, database administrator or related role.",
        "phone": "+1 (123) 456-7890",
        "email": "jobs@google.com",
        "address": "1600 Amphitheatre Parkway, Mountain View, CA 94043"
    },
    {
        "id": 2,
        "image": "https://i.postimg.cc/Y92xdL9f/netflix-4-1.png",
        "designation": "Senior Product Designer",
        "name": "Netflix",
        "type": "Remote",
        "location": "Los Gatos, CA",
        "salary": "$90,000 - $110,000",
        "duration": "Full Time",
        "job_description": "As a Senior Product Designer at Netflix, you will work on the design of our streaming service across multiple platforms. You will be responsible for driving innovation and creating elegant, effective user experiences.",
        "job_responsibilities": "Lead design projects from ideation to launch, collaborating with cross-functional teams to create innovative solutions.Conduct user research and usability testing to inform design decisions.Create and maintain design systems and style guides.Stay up-to-date with design trends and emerging technologies.Mentor junior designers and help maintain a strong design culture within the organization.",
        "educational_requirements": "Bachelor's degree in Design, Human-Computer Interaction, or related field, or equivalent practical experience.",
        "experience": "Minimum 7 years of experience in product design, with a portfolio demonstrating experience in designing user interfaces for web and mobile.",
        "phone": "+1 (123) 456-7890",
        "email": "jobs@netflix.com",
        "address": "100 Winchester Circle, Los Gatos, CA 95032"
    },
    {
        "id": 3,
        "image": "https://i.postimg.cc/cJ3CtdNR/tesla-9-1.png",
        "designation": "Software Engineer",
        "name": "Tesla",
        "type": "Onsite",
        "location": "Austin, TX",
        "salary": "$120,000 - $150,000",
        "duration": "Full Time",
        "job_description": "As a Software Engineer at Tesla, you will work on developing software for our cutting-edge electric vehicles and energy products. You will work in a fast-paced, innovative environment, and will be part of a team that is changing the world.",
        "job_responsibilities": "Develop software for electric vehicles and energy products Collaborate with a fast-paced, innovative team Continuously learn and adapt to new technologies Contribute to the mission of changing the world",
        "educational_requirements": "Bachelor's or Master's degree in Computer Science, Electrical Engineering, or a related field",
        "experience": "2+ years of professional experience in software engineering",
        "phone": "+1 (123) 456-7890",
        "email": "careers@tesla.com",
        "address": "Tesla Headquarters, 3500 Deer Creek Rd, Palo Alto, CA 94304"
    },
    {
        "id": 4,
        "image": "https://i.postimg.cc/15TyGbBJ/Group-10021.png",
        "designation": "Marketing Manager",
        "name": "Airbnb, Inc.",
        "type": "Remote",
        "location": "San Francisco, CA",
        "salary": "$70,000 - $90,000",
        "duration": "Part Time",
        "job_description": "As a Marketing Manager at Airbnb, you will be responsible for driving growth through creative marketing campaigns and initiatives. You will work in a dynamic, fast-paced environment, and will collaborate with cross-functional teams to achieve business objectives.",
        "job_responsibilities": "Develop and implement marketing strategies and initiatives to drive growth and increase brand awareness  Conduct market research and analyze data to inform marketing decisions  Manage and execute marketing campaigns across various channels, including email, social media, and paid advertising  Collaborate with cross-functional teams, including product, design, and data, to develop and execute effective marketing campaigns  Measure and report on the effectiveness of marketing campaigns and initiatives",
        "educational_requirements": "Bachelor's degree in Marketing, Communications, or a related field",
        "experience": "3-5 years of experience in a marketing or related role",
        "phone": "555-555-5555",
        "email": "jobs@airbnb.com",
        "address": "888 Brannan St, San Francisco, CA 94103"
    },
    {
        "id": 5,
        "image": "https://i.postimg.cc/50Why3s9/google-1-1-1.png",
        "designation": "Data Analyst",
        "name": "Google LLC",
        "type": "Onsite",
        "location": "Dublin, IR",
        "salary": "$95,000 - $125,000",
        "duration": "Full Time",
        "job_description": "As a Data Analyst at Google, you will work on analyzing complex data sets, and generating insights that will help drive business decisions. You will use your analytical skills to provide data-driven solutions to business problems, and work with cross-functional teams to ensure the quality and accuracy of data analysis.",
        "job_responsibilities": "Analyze large, complex data sets to identify trends, patterns, and insights that drive business decisions. Develop custom data models and algorithms to apply to data sets. Work with cross-functional teams to ensure the quality and accuracy of data analysis and reporting. Create data visualizations and dashboards to communicate insights and recommendations to stakeholders. Conduct ad hoc analysis and present findings to management and other stakeholders.",
        "educational_requirements": "- Bachelor's or Master's degree in Computer Science, Statistics, Mathematics, or a related field. Experience with data analysis and visualization tools such as SQL, R, Python, Tableau, etc. Strong analytical skills with the ability to work with large, complex data sets. Excellent communication skills with the ability to present findings and recommendations to stakeholders.",
        "experience": "- 2-5 years of experience in data analysis, business intelligence, or a related field. Experience in a fast-paced, dynamic environment with the ability to manage multiple projects simultaneously.",
        "phone": "+1-650-253-0000",
        "email": "jobs@google.com",
        "address": "Google Ireland Ltd., Gordon House, Barrow St, Dublin 4, Ireland"
    },
    {
        "id": 6,
        "image": "https://i.postimg.cc/Y92xdL9f/netflix-4-1.png",
        "designation": "UX Designer",
        "name": "Netflix",
        "type": "Onsite",
        "location": "Seattle, WA",
        "salary": "$75,000 - $100,000",
        "duration": "Part Time",
        "job_description": "As a UX Designer at Netflix, you will work on creating intuitive and engaging user experiences across various platforms including web, mobile, and TV. You will collaborate with cross-functional teams to deliver world-class design solutions that meet business and user needs. You will have the opportunity to work on high-visibility projects that will impact millions of users worldwide.",
        "job_responsibilities": "Collaborate with cross-functional teams to understand business and user needs, and design solutions that meet those needs Conduct user research and testing to inform design decisions Create wireframes, prototypes, and high-fidelity mockups that communicate design concepts and solutions Work closely with developers to ensure design solutions are implemented accurately Continuously iterate and improve designs based on feedback and testing results",
        "educational_requirements": "Bachelor's degree in Design, Human-Computer Interaction, or a related field Strong portfolio demonstrating expertise in user-centered design principles and practices",
        "experience": "3+ years of experience in UX design Experience working with design tools such as Sketch, Figma, and Adobe Creative Suite Experience conducting user research and testing Experience collaborating with cross-functional teams",
        "phone": "555-555-5555",
        "email": "jobs@netflix.com",
        "address": "1234 Main Street, Seattle, WA 98101"
    },
    {
        "id": 7,
        "image": "https://i.postimg.cc/15TyGbBJ/Group-10021.png",
        "designation": "Accountant",
        "name": "Airbnb, Inc.",
        "type": "Onsite",
        "location": "San Francisco, CA",
        "salary": "$60,000 - $80,000",
        "duration": "Full Time",
        "job_description": "As an Accountant at Airbnb, you will be responsible for managing financial records, preparing financial statements and reports, and ensuring compliance with accounting regulations. You will work closely with other members of the accounting team and with other departments across the company.",
        "job_responsibilities": "Develop and maintain accounting principles, practices and procedures to ensure accurate and timely financial statements. Ensure financial records are maintained in compliance with accounting policies and procedures. Manage accounts payable, accounts receivable, and payroll. Prepare and review financial statements and reports. Assist with budget preparation and monitoring. Analyze financial data and provide insights to the management team. Collaborate with other departments to ensure proper financial reporting and compliance.",
        "educational_requirements": "Bachelor's degree in Accounting, Finance, or related field.",
        "experience": "2-5 years of experience in accounting or finance.",
        "phone": "+1 (123) 456-7890",
        "email": "accountant@airbnb.com"
    },
    {
        "id": 8,
        "image": "https://i.postimg.cc/cJ3CtdNR/tesla-9-1.png",
        "designation": "Mechanical Engineer",
        "name": "Tesla",
        "type": "Onsite",
        "location": "Austin, TX",
        "salary": "$95,000 - $115,000",
        "duration": "Full Time",
        "job_description": "As a Mechanical Engineer at Tesla, you will be responsible for designing and developing mechanical systems and components for our electric vehicles. You will work closely with other engineers and designers to ensure that our products meet performance, safety, and reliability standards.",
        "job_responsibilities": "Design and develop mechanical systems and components for Tesla electric vehicles. Perform engineering analysis and testing to validate design concepts. Collaborate with other engineers and designers to integrate mechanical systems with electrical and software components. Participate in design reviews and provide feedback to other team members. Create and maintain engineering documentation, including drawings, specifications, and test reports. Stay up to date with the latest developments in mechanical engineering and apply this knowledge to improve Tesla's products and processes.",
        "educational_requirements": "Bachelor's degree in Mechanical Engineering or related field.",
        "experience": "2-5 years of experience in mechanical engineering or related field.",
        "phone": "+1 555-123-4567",
        "email": "careers@tesla.com",
        "address": "Tesla, Inc.\n123 Main Street\nAustin, TX 78701"
    },
    {
        "id": 9,
        "image": "https://i.postimg.cc/50Why3s9/google-1-1-1.png",
        "designation": "Information Security Analyst",
        "name": "Google LLC",
        "type": "Remote",
        "location": "Portland, OR",
        "salary": "125,000 - $175,000",
        "duration": "Full Time",
        "job_description": "As an Information Security Analyst at Google, you will be responsible for maintaining the security of the company's systems and data. You will work closely with other members of the security team and with other departments across the company.",
        "job_responsibilities": "Conduct security assessments and risk analyses. Implement and manage security controls. Monitor for and respond to security incidents. Provide security guidance and training to other employees. Stay up-to-date on the latest security threats and trends.",
        "educational_requirements": "Bachelor's degree in Computer Science, Information Security, or related field.",
        "experience": "3-5 years of experience in information security or related field.",
        "phone": "555-555-5555",
        "email": "infosecjob@google.com",
        "address": "1600 Amphitheatre Parkway, Mountain View, CA 94043"
    },
    {
        "id": 10,
        "image": "https://i.postimg.cc/Y92xdL9f/netflix-4-1.png",
        "designation": "Content Writer",
        "name": "Netflix",
        "type": "Remote",
        "location": "Miami, FL",
        "salary": "$55,000 - $75,000",
        "duration": "Part Time",
        "job_description": "As a Content Writer at Netflix, you will be responsible for writing engaging and informative content for our various online platforms. This may include blogs, social media posts, emails, and other types of content as needed.",
        "job_responsibilities": "- Research and write high-quality content that aligns with our brand voice and tone.Collaborate with other members of the content team to ensure consistency across all platforms. Stay up-to-date with industry trends and make recommendations for new content ideas. Proofread and edit content to ensure accuracy and clarity. Work closely with other departments, such as marketing and product, to ensure that content is aligned with business objectives.",
        "educational_requirements": "Bachelor's degree in English, Journalism, Communications, or a related field.",
        "experience": "2-4 years of experience in content writing, copywriting, or a related field.",
        "phone": "(123) 456-7890",
        "email": "contentwriter@netflix.com"
    }
]